library(tidyverse)
library(geojsonio)
library(leaflet)
library(RColorBrewer)

#Препроцессинг данных:

rus <- geojson_read("russia.geojson", what = "sp")

pals <- pals %>% 
  filter(category == "seq") %>% 
  select(1) %>% 
  rownames()

pal <- brewer.pal(9, pals[1])


setdiff(rus@data$name, dat$Регион)
setdiff(dat$Регион, rus@data$name)

rus@data$name <- str_replace_all(rus@data$name, c("Кабардино-Балкарская республика" = "Кабардино-Балкарская Республика",
                                 "Бурятия" = "Республика Бурятия",
                                 "Марий Эл" = "Республика Марий Эл",
                                 "Тыва" = "Республика Тыва",
                                 "Чувашия" = "Чувашская Республика",
                                 "Дагестан" = "Республика Дагестан",
                                 "Северная Осетия - Алания" = "Республика Северная Осетия-Алания",
                                 "Удмуртская республика" = "Удмуртская Республика",
                                 "Ямало-Ненецкий автономный округ" = "Ямало-Ненецкий АО",
                                 "Башкортостан" = "Республика Башкортостан",
                                 "Карачаево-Черкесская республика" = "Республика Карачаево-Черкессия",
                                 "Татарстан" = "Республика Татарстан",
                                 "Ханты-Мансийский автономный округ - Югра" = "Ханты-Мансийский АО - Югра",
                                 "Республика Мордовия" = "Мордовия",
                                 "Ненецкий автономный округ" = "Ямало-Ненецкий АО",
                                 "Алтай" = "Алтайский край")) 

dat_small <- dat %>% 
  select(Регион, `Индекс потребительской активности`, `Доля безналичных платежей`, `Среднемесячная заработная плата`)

dat_small <- dat_small %>% 
  group_by(Регион) %>% 
  reframe(`Индекс потребительской активности` = mean(`Индекс потребительской активности`), 
          `Доля безналичных платежей` = mean(`Доля безналичных платежей`), 
          `Среднемесячная заработная плата` = mean(`Среднемесячная заработная плата`))

rus@data <- left_join(rus@data, dat_small, join_by(name == `Регион`))


rus %>% 
  leaflet() %>% 
  addTiles() %>% 
  addPolygons(stroke = FALSE, fill = pal, label = ~name) %>% 
  setView(lng = 100, lat = 66, zoom = 2)
  
rus@data %>% view()

str(rus@data)
